// --створити масив з:
// - з 5 числових значень

// let a = [1,2,3,4,5];

// - з 5 стічкових значень

// let a = ['a','b','d','c','r'];

// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

// let a = [1,2,'a','b',true];
// console.log(a);

//-- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу.
//   Вивести в консоль.

// let a = [];
//     a[0] = 1;
//     a[1] = 2;
//     a[2] = 3;
//     console.log(a);

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

// for (let i = 1; i < 11; i++) {
//     document.write(`<div>kek</div>`);
// }

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині

// for (let i = 1; i < 11; i++) {
//     document.write(`<div>kek ${i}</div>`);
// }


// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.

// let a = 1;
// while (a < 21) {
//     document.write(`<div>kek</div>`)
//     a++;
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

// let a = 1;
// while (a < 21) {
//     document.write(`<div>${a} kek</div>`)
//     a++;
// }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

// let a = [1,2,3,4,5,6,7,8,9,10];
//
// for (let i = 0; i < 10; i++) {
//     console.log(a[i]);
// }

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

// let a = ['a','b','c','d','f','g','q','w','e','h'];
//
// for (let i = 0; i < a.length; i++) {
//     console.log(a[i]);
// }

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

// let a = [1,2,3,4,'a','b','c','d',true,false];
//
// for (let i = 0; i < a.length; i++) {
//     console.log(a[i]);
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи

// let a = [1,2,3,4,'a','b','c','d',true,false];
//
// for (let i = 0; i < a.length; i++) {
//     if (typeof a[i] === 'boolean') {
//         console.log(a[i]);
//     }
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи

// let a = [1,2,3,4,'a','b','c','d',true,false];
//
// for (let i = 0; i < a.length; i++) {
//     if (typeof a[i] === 'number') {
//         console.log(a[i]);
//     }
// }

// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

// let a = [1,2,3,4,'a','b','c','d',true,false];
//
// for (let i = 0; i < a.length; i++) {
//     if (typeof a[i] === 'string') {
//         console.log(a[i]);
//     }
// }

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.

// let a = [];
// a[0] = 1;
// a[1] = 2;
// a[2] = 3;
// a[3] = 4;
// a[4] = 'a';
// a[5] = 'b';
// a[6] = 'c';
// a[7] = 'd';
// a[8] = true;
// a[9] = false;
// for (let i = 0; i < a.length; i++) {
//     console.log(a[i]);
// }

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i < 10; i++) {
//     console.log(i);
//     document.write(i);
// }

// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i < 100; i++) {
//     console.log(i);
//     document.write(i);
// }

// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i < 10; i+=2) {
//     console.log(i);
//     document.write(i);
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write

// for (let i = 0; i < 100; i++) {
//     if (i % 2 === 0) {
//         console.log(i);
//         document.write(i);
//     }
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

// for (let i = 0; i < 100; i++) {
//     if (i % 2 === 1) {
//         console.log(i);
//         document.write(i);
//     }
// }

