// 1. Створити пустий масив та :
//     a. заповнити його 50 парними числами за допомоги циклу.
//     b. заповнити його 50 непарними числами за допомоги циклу.
//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)

// let a = [];
// let a1 = [];
// for (let i = 0; i < 100; i++) {
//     (i % 2 === 0) ? a[a.length] = i : a1[a1.length] = i;
// }
// console.log(a);
// console.log(a1);

// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)

// let a = [];
//  for (let i = 0; i < 20; i++) {
//      a[i] = Math.floor(Math.random()*(732-8)+8);
//  }
//  console.log(a);


// 2. Вивести за допомогою console.log кожен третій елемен

// for (let i = 0; i < a.length; i+=3) {
//     console.log(a[i]);
// }


// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.

// for (let i = 0; i < a.length; i+=3) {
//     if (a[i] % 2 === 0) {
//         console.log(a[i]);
//     }
// }

// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив

// let a2 = [];
// for (let i = 0; i < a.length; i+=3) {
//     if (a[i] % 2 === 0) {
//      a2.push(a[i]) ;
//     }
// }
// console.log(a2);

// 5. Вивести кожен елемент масиву, сусід справа якого є парним
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56

// let a = [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ];
//
// for (let i = 0; i < a.length; i++) {
//     if (a[i+1] % 2 === 0) {
//         console.log(a[i]);
//     }
// }

// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки.
// Обрахувати середній чек.

// let a = [100,250,50,168,120,345,188];
// let sum = 0;
//
// for (let i = 0; i < a.length; i++) {
//     sum += a[i];
// }
// console.log(sum / a.length);




// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.

// let a = [];
// let a2 = [];
// for (let i = 0; i < 20; i++) {
//     a[i] = Math.floor(Math.random() * (30 - 8) + 8);
//     a2.push(a[i] * 5)
// }
// console.log(a2)

// 8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому,
// і якщо елемент є числом - додати його в інший масив.

// let a = ['a','b','c','d',1,2,3,4,true,false];
// let a2 = [];
// let a3 = [];
// let a4 = [];
// for (let i = 0; i < a.length; i++) {
//     console.log(a[i]);
//     if (typeof a[i] === 'string') {
//         a2.push(a[i]);
//     }
//     else if (typeof a[i] === 'number') {
//         a3.push(a[i]);
//     }
//     else if (typeof a[i] === 'boolean') {
//         a4.push(a[i]);
//     }
// }
// console.log(a2);
// console.log(a3);
// console.log(a4);


